// Считать с клавиатуры два целых числа, причём второе число не меньше первого.
// Вывести в строку все нечётные числа в промежутке от первого до второго включительно.
// В указанном промежутке гарантируется на вывод хотя бы одно число.

#include <stdio.h>

int main() {
    int min, max;
    
    scanf("%d %d", &min, &max);
    if ( min % 2 == 0 ) {
        min += 1;
    }
    if ( max % 2 == 0 ) {
        max -= 1;
    }
    for ( int i = min; i < max; i += 2 ) {
        printf("%d ", i);
    }
    
    printf("%d\n", max);
    
    return 0;
}
